package by.htp.home01.main;

/*7. Дан прямоугольник, ширина которого в два раза меньше длины. 
Найти площадь прямоугольника */

public class Task07 {

    public static void main(String[] args) {
	int a = 10;
	int b = 5;

	int p = a * b;

	System.out.println("Площадь прямоугольника = " + p);
    }
}
